# HOW TO READ HTML FILE USING PANDAS AND ANALYSIS

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [24]:
data=pd.read_html('C:/Users/shruti sahrawat/Desktop/DA Project/dataset/traintime.html',header=2)

In [20]:
type(data)

list

In [26]:
data

[    Name of Train      Place Destination Departure Arrival       Fare  \
 0    Rajdhani Exp     Bombay       Delhi    2:30am  8:45am  1989.00rs
 1    Sataabdi Exp   Bangluru       Delhi    7:30am  6:45pm   789.00rs
 2  SaptKranti Exp  Gorakhpur       Delhi    5:30am  9:45pm   589.00rs
 3    Rajdhani Exp    Lucknow       Delhi    5:30pm  6:45am  1189.00rs

    Unnamed: 6  Unnamed: 7  Unnamed: 8
 0         NaN         NaN         NaN
 1         NaN         NaN         NaN
 2         NaN         NaN         NaN
 3         NaN         NaN         NaN  ]

In [28]:
#list doesnot supports panadas methods
# to use df

In [34]:
data=data[0]

In [36]:
type(data)

pandas.core.frame.DataFrame

In [38]:
data=data.dropna(axis='columns')

In [40]:
data

    Name of Train      Place Destination Departure Arrival       Fare
0    Rajdhani Exp     Bombay       Delhi    2:30am  8:45am  1989.00rs
1    Sataabdi Exp   Bangluru       Delhi    7:30am  6:45pm   789.00rs
2  SaptKranti Exp  Gorakhpur       Delhi    5:30am  9:45pm   589.00rs
3    Rajdhani Exp    Lucknow       Delhi    5:30pm  6:45am  1189.00rs

In [44]:
data.to_excel('C:/Users/shruti sahrawat/Desktop/DA Project/dataset/new_table.xlsx',index=False)